VDowbensky/Current-generator/FW_STM8L_IAR/iostm8l151k6.h
#define MASK_RTC_SPRERL_PREDIV_S0 0x01
#define MASK_RTC_SPRERL_PREDIV_S1 0x02
#define MASK_RTC_SPRERL_PREDIV_S2 0x04
#define MASK_RTC_SPRERL_PREDIV_S3 0x08
#define MASK_RTC_SPRERL_PREDIV_S4 0x10
#define MASK_RTC_SPRERL_PREDIV_S5 0x20
#define MASK_RTC_SPRERL_PREDIV_S6 0x40
#define MASK_RTC_SPRERL_PREDIV_S7 0x80

#define MASK_RTC_APRER_PREDIV_A  0x7F

#define MASK_RTC_WUTRH_WUT8      0x01
#define MASK_RTC_WUTRH_WUT9      0x02
#define MASK_RTC_WUTRH_WUT10     0x04
#define MASK_RTC_WUTRH_WUT11     0x08
#define MASK_RTC_WUTRH_WUT12     0x10
#define MASK_RTC_WUTRH_WUT13     0x20
#define MASK_RTC_WUTRH_WUT14     0x40
#define MASK_RTC_WUTRH_WUT15     0x80

#define MASK_RTC_WUTRL_WUT0      0x01
#define MASK_RTC_WUTRL_WUT1      0x02
#define MASK_RTC_WUTRL_WUT2      0x04
#define MASK_RTC_WUTRL_WUT3      0x08
#define MASK_RTC_WUTRL_WUT4      0x10
#define MASK_RTC_WUTRL_WUT5      0x20
#define MASK_RTC_WUTRL_WUT6      0x40
#define MASK_RTC_WUTRL_WUT7      0x80

#define MASK_RTC_ALRMAR1_ALSU    0x0F
#define MASK_RTC_ALRMAR1_ALST    0x70
#define MASK_RTC_ALRMAR1_MSK1    0x80

#define MASK_RTC_ALRMAR2_ALMNU   0x0F
#define MASK_RTC_ALRMAR2_ALMNT   0x70
#define MASK_RTC_ALRMAR2_MSK2    0x80

#define MASK_RTC_ALRMAR3_ALHU    0x0F
#define MASK_RTC_ALRMAR3_ALHT    0x30
#define MASK_RTC_ALRMAR3_PM      0x40
#define MASK_RTC_ALRMAR3_MSK3    0x80

#define MASK_RTC_ALRMAR4_ALDU    0x0F
#define MASK_RTC_ALRMAR4_ALDT    0x30
#define MASK_RTC_ALRMAR4_WDSEL   0x40
#define MASK_RTC_ALRMAR4_MSK4    0x80


/*-------------------------------------------------------------------------
 *      SPI1 register definitions
 *-----------------------------------------------------------------------*/
/* SPI1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CPHA        : 1;
  unsigned char CPOL        : 1;
  unsigned char MSTR        : 1;
  unsigned char BR          : 3;
  unsigned char SPE         : 1;
  unsigned char LSBFIRST    : 1;
} __BITS_SPI1_CR1;
#endif
__IO_REG8_BIT(SPI1_CR1,    0x5200, __READ_WRITE, __BITS_SPI1_CR1);

/* SPI1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SSI         : 1;
  unsigned char SSM         : 1;
  unsigned char RXONLY      : 1;
  unsigned char             : 1;
  unsigned char CRCNEXT     : 1;
  unsigned char CRCEN       : 1;
  unsigned char BDOE        : 1;
  unsigned char BDM         : 1;
} __BITS_SPI1_CR2;
#endif
__IO_REG8_BIT(SPI1_CR2,    0x5201, __READ_WRITE, __BITS_SPI1_CR2);

/* SPI1 interrupt control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXDMAEN     : 1;
  unsigned char TXDMAEN     : 1;
  unsigned char             : 2;
  unsigned char WKIE        : 1;
  unsigned char ERRIE       : 1;
  unsigned char RXIE        : 1;
  unsigned char TXIE        : 1;
} __BITS_SPI1_ICR;
#endif
__IO_REG8_BIT(SPI1_ICR,    0x5202, __READ_WRITE, __BITS_SPI1_ICR);

/* SPI1 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXNE        : 1;
  unsigned char TXE         : 1;
  unsigned char             : 1;
  unsigned char WKUP        : 1;
  unsigned char CRCERR      : 1;
  unsigned char MODF        : 1;
  unsigned char OVR         : 1;
  unsigned char BSY         : 1;
} __BITS_SPI1_SR;
#endif
__IO_REG8_BIT(SPI1_SR,     0x5203, __READ_WRITE, __BITS_SPI1_SR);

/* SPI1 data register */
__IO_REG8    (SPI1_DR,     0x5204, __READ_WRITE);
/* SPI1 CRC polynomial register */
__IO_REG8    (SPI1_CRCPR,  0x5205, __READ_WRITE);
/* SPI1 Rx CRC register */
__IO_REG8    (SPI1_RXCRCR, 0x5206, __READ);
/* SPI1 Tx CRC register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TXCRC       : 7;
} __BITS_SPI1_TXCRCR;
#endif
__IO_REG8_BIT(SPI1_TXCRCR, 0x5207, __READ, __BITS_SPI1_TXCRCR);


/*-------------------------------------------------------------------------
 *      SPI1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define SPI1_CR1_CPHA            SPI1_CR1_bit.CPHA
#define SPI1_CR1_CPOL            SPI1_CR1_bit.CPOL
#define SPI1_CR1_MSTR            SPI1_CR1_bit.MSTR
#define SPI1_CR1_BR              SPI1_CR1_bit.BR
#define SPI1_CR1_SPE             SPI1_CR1_bit.SPE
#define SPI1_CR1_LSBFIRST        SPI1_CR1_bit.LSBFIRST

#define SPI1_CR2_SSI             SPI1_CR2_bit.SSI
#define SPI1_CR2_SSM             SPI1_CR2_bit.SSM
#define SPI1_CR2_RXONLY          SPI1_CR2_bit.RXONLY
#define SPI1_CR2_CRCNEXT         SPI1_CR2_bit.CRCNEXT
#define SPI1_CR2_CRCEN           SPI1_CR2_bit.CRCEN
#define SPI1_CR2_BDOE            SPI1_CR2_bit.BDOE
#define SPI1_CR2_BDM             SPI1_CR2_bit.BDM

#define SPI1_ICR_RXDMAEN         SPI1_ICR_bit.RXDMAEN
#define SPI1_ICR_TXDMAEN         SPI1_ICR_bit.TXDMAEN
#define SPI1_ICR_WKIE            SPI1_ICR_bit.WKIE
#define SPI1_ICR_ERRIE           SPI1_ICR_bit.ERRIE
#define SPI1_ICR_RXIE            SPI1_ICR_bit.RXIE
#define SPI1_ICR_TXIE            SPI1_ICR_bit.TXIE

#define SPI1_SR_RXNE             SPI1_SR_bit.RXNE
#define SPI1_SR_TXE              SPI1_SR_bit.TXE
#define SPI1_SR_WKUP             SPI1_SR_bit.WKUP
#define SPI1_SR_CRCERR           SPI1_SR_bit.CRCERR
#define SPI1_SR_MODF             SPI1_SR_bit.MODF
#define SPI1_SR_OVR              SPI1_SR_bit.OVR
#define SPI1_SR_BSY              SPI1_SR_bit.BSY

#define SPI1_TXCRCR_TXCRC        SPI1_TXCRCR_bit.TXCRC

#endif

/*-------------------------------------------------------------------------
 *      SPI1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_SPI1_CR1_CPHA       0x01
#define MASK_SPI1_CR1_CPOL       0x02
#define MASK_SPI1_CR1_MSTR       0x04
#define MASK_SPI1_CR1_BR         0x38
#define MASK_SPI1_CR1_SPE        0x40
#define MASK_SPI1_CR1_LSBFIRST   0x80

#define MASK_SPI1_CR2_SSI        0x01
#define MASK_SPI1_CR2_SSM        0x02
#define MASK_SPI1_CR2_RXONLY     0x04
#define MASK_SPI1_CR2_CRCNEXT    0x10
#define MASK_SPI1_CR2_CRCEN      0x20
#define MASK_SPI1_CR2_BDOE       0x40
#define MASK_SPI1_CR2_BDM        0x80

#define MASK_SPI1_ICR_RXDMAEN    0x01
#define MASK_SPI1_ICR_TXDMAEN    0x02
#define MASK_SPI1_ICR_WKIE       0x10
#define MASK_SPI1_ICR_ERRIE      0x20
#define MASK_SPI1_ICR_RXIE       0x40
#define MASK_SPI1_ICR_TXIE       0x80

#define MASK_SPI1_SR_RXNE        0x01
#define MASK_SPI1_SR_TXE         0x02
#define MASK_SPI1_SR_WKUP        0x08
#define MASK_SPI1_SR_CRCERR      0x10
#define MASK_SPI1_SR_MODF        0x20
#define MASK_SPI1_SR_OVR         0x40
#define MASK_SPI1_SR_BSY         0x80

#define MASK_SPI1_TXCRCR_TXCRC   0x7F


/*-------------------------------------------------------------------------
 *      I2C1 register definitions
 *-----------------------------------------------------------------------*/
/* I2C1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char SMBUS       : 1;
  unsigned char             : 1;
  unsigned char SMBTYPE     : 1;
  unsigned char ENARP       : 1;
  unsigned char ENPEC       : 1;
  unsigned char ENGC        : 1;
  unsigned char NOSTRETCH   : 1;
} __BITS_I2C1_CR1;
#endif
__IO_REG8_BIT(I2C1_CR1,    0x5210, __READ_WRITE, __BITS_I2C1_CR1);

